'''
Tasks
Conditional operator
Максимум з двох чисел

Функція приймає 2 числа і має повернути більше з них
'''



def bigger(a, b):
    if a > b:
        return a
    else:
        return b
#a = float(input("Введите первое число: "))
#b = float(input("Введите второе число: "))
#print(bigger(9, 8))

'''
Високосний рік
Функція приймає єдиний параметр - рік. Має вивести “Yes” якщо рік вискосний і “No” в іншому випадку
'''

def leap(year):
    if((year % 400 == 0) or (year % 100 != 0) and (year % 4 == 0)):
        print("Yes")
    else:
        print("No")

#year = int(input("Enter year: "))
#leap(year)


'''Тура
Функція приймає координати 2 шахових фігур - Тури і цілі. Має вивести “Yes” якщо Тура може вразити ціль за 1 хід і “No” в іншому випадку
'''


'''Кінь
Функція приймає координати 2 шахових фігур - Коня і цілі. Має вивести “Yes” якщо Кінь може вразити ціль за 1 хід і “No” в іншому випадку '''



'''Морозиво*
В кафе продають морозиво по 3 і по 5 кульок. Можно купити будь яку кількість морозива по 3 і по 5 кульок одночасно.
Функція приймає єдине число - кількість кульок, які бажає купити людина. Має вивести “Yes” якщо таку кількість можна купити і “No” якщо ні.'''


def ice_cream(a):
    if ((a == 3) or (a == 5) or (a == 8)):
        print("Yes")
    else:
        print("No")
#a = int(input("Input ice: "))
#ice_cream(3) or (a)

'''Cycle

Функція приймає 2 числа, має вивести всі парні числа між ними'''
def even_numbers(a, b):


num1 = int(input("Введіть першу цифру: "))
num2 = int(input("Введіть другу цифру: "))
difference1 = num1 - num2 - 1
difference2 = num2 - num1 - 1

# show numbers between num1 and num2
if difference1 >= 1:
    for x in range(difference1):
        if (x % 2 != 0):
            print(x + 3)
else:
    for x in range(difference2):
        if (x % 2 != 0):
            print(x + 3)


'''Дільники числа
Функція приймає єдине число, має вивести всі дільники цього числа'''


'''Кількість дільників числа

Функція приймає єдине число, має вивести кількість дільників цього числа

Сумма чисел

Функція приймає будь яку кількість чисел, має порахувати і вивести їх сумму
Нуль

Функція приймає будь яку кількість чисел, має вивести “Yes” якщо серед них є нуль і “No” якщо немає

Strings
Робимо срізи

Функція приймає на вхід строку, має вивести:
3-ій символ
передостаній символ
перші п'ять символів строки
вся строка крім останіх двох символів
всі символи з парними індексами
всі символи з непарними індексами
строку в зворотному напрямі
довжину строки
Кількість слів

Функція отримую строку, де слова розділені через пробіл, вивести кількість слів.
Видалення фрагменту

Функція отримує строку, де літера “h” зустрічається щонайменше 2 рази, потрібно видалити перше і останнє входження цієї літери і всі символи між німи
Заміна підрядка

Функція отримує строку, потрібно замінити все “1” на “one”

Lists

Парні індекси

Функція приймає список чисел. Потрібно вивестивсі числа з парними індексами
Парні елементи

Функція приймає список чисел. Потрібно вивести всі парні елементи списку
Найбільше число

Функція приймає список чисел. Потрібно вивести найбільше число і його індекс
Зворотній порядок

Функція приймає список чисел. Має повернути список але у зворотному порядку
Унікальні елементи

Функція приймає список чисел. Потрібно повернути лише ті елементи що зустрічаються один раз

Написати функцію що вміє сортувати список чисел по порядку.
'''



