#conditional operator
'''Conditional operator
Максимум з двох чисел
Функція приймає 2 числа і має повернути більше з них'''

def bigger(a, b):
    if a > b:
        return a
    else:
        return b


'''Високосний рік
Функція приймає єдиний параметр - рік. Має вивести “Yes” якщо рік вискосний і “No” в іншому випадку'''
def leap(year):
    if((year % 400 == 0) or (year % 100 != 0) and (year % 4 == 0)):
        return str("Yes")
    else:
        return str("No")


'''Тура
Функція приймає координати 2 шахових фігур - Тури і цілі. Має вивести “Yes” якщо Тура може вразити ціль за 1 хід і “No” в іншому випадку

Кінь
Функція приймає координати 2 шахових фігур - Коня і цілі. Має вивести “Yes” якщо Кінь може вразити ціль за 1 хід і “No” в іншому випадку

Морозиво*
В кафе продають морозиво по 3 і по 5 кульок. Можно купити будь яку кількість морозива по 3 і по 5 кульок одночасно.
Функція приймає єдине число - кількість кульок, які бажає купити людина. Має вивести “Yes” якщо таку кількість можна купити і “No” якщо ні'''

def ice_cream(a):
    if ((a == 3) or (a == 5) or (a == 8)):
        return str("Yes")
    else:
        return str("No")

