#cicles

'''Cycle
Парні числа
Функція приймає 2 числа, має вивести всі парні числа між ними'''

def even_numbers(a, b):
    list = range(a, b) or range(b, a)
    num = []
    for x in list:
        if x % 2 == 0:
            num.append(x)
    return num



'''Дільники числа
Функція приймає єдине число, має вивести всі дільники цього числа

Кількість дільників числа
Функція приймає єдине число, має вивести кількість дільників цього числа

Сумма чисел
Функція приймає будь яку кількість чисел, має порахувати і вивести їх сумму
Нуль
Функція приймає будь яку кількість чисел, має вивести “Yes” якщо серед них є нуль і “No” якщо немає'''
