#lists
'''Lists

Парні індекси
Функція приймає список чисел. Потрібно вивестивсі числа з парними індексами

Парні елементи
Функція приймає список чисел. Потрібно вивести всі парні елементи списку

Найбільше число
Функція приймає список чисел. Потрібно вивести найбільше число і його індекс

Зворотній порядок
Функція приймає список чисел. Має повернути список але у зворотному порядку

Унікальні елементи
Функція приймає список чисел. Потрібно повернути лише ті елементи що зустрічаються один раз'''
