#strings
'''Strings
Робимо срізи
Функція приймає на вхід строку, має вивести:
3-ій символ
передостаній символ
перші п'ять символів строки
вся строка крім останіх двох символів
всі символи з парними індексами
всі символи з непарними індексами
строку в зворотному напрямі
довжину строки'''




'''Кількість слів
Функція отримую строку, де слова розділені через пробіл, вивести кількість слів.'''



'''Видалення фрагменту
Функція отримує строку, де літера “h” зустрічається щонайменше 2 рази, потрібно видалити перше і останнє входження цієї літери і всі символи між німи'''



'''Заміна підрядка
Функція отримує строку, потрібно замінити все “1” на “one”'''
